In [1]:
# Encoding

In [2]:
# Categorical Encoding
# Label Encoding is ordinal form of encoding but used in Output varible
# One hot encoding for input variable

In [3]:
# import required modules
import pandas as pd
import numpy as np

# create dataset
df = pd.DataFrame({'Temperature': ['Hot', 'Cold', 'Warm', 'Cold'],
				})

# display dataset
print(df)

  Temperature
0         Hot
1        Cold
2        Warm
3        Cold

In [4]:
# One hot encoding
# create dymmy variables
pd.get_dummies(df)

   Temperature_Cold  Temperature_Hot  Temperature_Warm
0                 0                1                 0
1                 1                0                 0
2                 0                0                 1
3                 1                0                 0

In [5]:
# create dataset
df = pd.DataFrame({'A': ['Alberto', 'vasanthi', 'Asalah'],
				'B': ['vasanthi', 'Alberto', 'Alberto'],
				'C': [1, 2, 3]})

In [7]:
# display dataset
print(df)

# create dymmy variables
pd.get_dummies(df['A'])

          A         B  C
0   Alberto  vasanthi  1
1  vasanthi   Alberto  2
2    Asalah   Alberto  3

   Alberto  Asalah  vasanthi
0        1       0         0
1        0       0         1
2        0       1         0

In [8]:
df = pd.read_csv('cars.csv')

In [9]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [10]:
df['owner'].value_counts()

First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: owner, dtype: int64

In [11]:
# One hot encoding using Pandas
pd.get_dummies(df,columns=['fuel','owner'])

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

In [12]:
# Label Encoding

In [23]:
from sklearn.preprocessing import LabelEncoder
df = pd.read_csv('Placement_Data_Full_Class.csv')
df.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [24]:
df['Species'].unique()

KeyError: 'Species'

In [21]:
# label_encoder object knows how to understand word labels.
le=LabelEncoder()

In [25]:
df['hsc_b']= le.fit_transform(df['hsc_b'])
df['hsc_b']

0      1
1      1
2      0
3      0
4      0
      ..
210    1
211    1
212    1
213    1
214    1
Name: hsc_b, Length: 215, dtype: int32